cask_args appdir: "/Applications"
tap "homebrew/cask"
# Vim
brew 'vim', args: ['with-override-system-vi']
tap 'universal-ctags/universal-ctags'
brew 'universal-ctags', args:['HEAD']
brew 'fzf'

# Package managers
brew 'rbenv'
brew 'pipenv'
brew 'node'

# Languages
brew 'go'

# Database-related
brew 'postgresql'
brew 'redis'
brew 'mongodb'

# Utility
brew 'stow'
brew 'tree'
brew 'trash'

tap 'heroku/brew'
brew 'heroku'

## Casks ##
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'iina'
cask 'iterm2'
cask 'keepassxc'
cask 'postman'
cask 'postico'
cask 'visual-studio-code'
