cask_args appdir: "/Applications"
tap "homebrew/cask"
# Vim
brew 'neovim', args: ['HEAD']
brew 'vim', args: ['with-override-system-vi']

# Package managers
brew 'nvm'
brew 'pipenv'
brew 'rbenv'

# Languages
brew 'go'

# Database-related
brew 'mongodb'
brew 'postgresql'
brew 'redis'

# Shell
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'fd'
brew 'fzf'
brew 'ripgrep'
brew 'tmux'

# Git
brew 'bash-git-prompt'
brew 'git'

# Utility
brew 'stow'
brew 'trash'
brew 'tree'
brew 'xclip'

tap 'heroku/brew'
brew 'heroku'

tap 'homebrew/cask-fonts'
cask 'font-fira-code'

## Casks ##
cask 'firefox-developer-edition'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iina'
cask 'iterm2'
cask 'keepassxc'
cask 'postico'
cask 'postman'
cask 'visual-studio-code'
cask 'xquartz' # Needed for xclip
