cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "homebrew/cask-versions"

# Vim
brew 'neovim'
brew 'vim', args: ['with-override-system-vi']

# Package managers
# brew 'nvm' # Not offically supported.
# brew 'pipenv'
brew 'rbenv'

# Database-related
# brew 'mongodb'
brew 'postgresql'
# brew 'pspg'
brew 'redis'
tap 'dbcli/tap'
brew 'pgcli'

# Shell
# For bash, echo $BASH_VERSION might be older ver. Steps:
# sudo bash -c 'echo /usr/local/bin/bash >> /etc/shells'
# chsh -s /usr/local/bin/bash 
brew 'bash'
brew 'bash-completion'
brew 'bat' # Colorized cat
brew 'fd' # find alternative
brew 'fzf' # Fuzzy finder
brew 'jq' # Command line JSON processor
brew 'ranger' # Command-line file-explorer
brew 'ripgrep' # Git grep alternative
brew 'tmux' # Session manager

# Git
brew 'bash-git-prompt'
brew 'git'

## Casks ##
# cask 'amethyst' # Tiling window manager
# cask 'balenaetcher' # Image flasher
cask 'dropbox'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'iina' # Media player
cask 'karabiner-elements' # Keyboard mapper
cask 'keepassxc' # Password manager
cask 'xquartz' # Needed for xclip

# Utility
brew 'stow' # Symlink manager
brew 'trash' # Move to trash with CLI
brew 'tree' # Shows directory as a tree
brew 'xclip' # Copy from shell to clipboard

# tap 'heroku/brew'
# brew 'heroku'

# Fonts
tap 'homebrew/cask-fonts'
# cask 'font-fira-code'
cask 'font-noto-sans'
cask 'font-source-code-pro'
